### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
data_file = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(data_file)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [2]:
# Total number of unique players

total_players = purchase_data["SN"].nunique()
total_players
total_players_df = pd.DataFrame({"Total Players": [total_players]})
total_players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [3]:
# Number of unique items

unique_items = len(purchase_data["Item Name"].unique())
unique_items

179

In [4]:
# Average purchase price (mean of price)

avg_price = purchase_data["Price"].mean()
avg_price

3.050987179487176

In [5]:
# Number of purchases

purchases = purchase_data["Purchase ID"].count()
purchases

780

In [6]:
# Total Revenue (sum of price)

total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [7]:
# Purchasing analysis dataframe

purchasing_analysis = pd.DataFrame({"Number of Unique Items": [unique_items],
                                    "Average Price": [avg_price],
                                    "Number of Purchases": [purchases],
                                    "Total Revenue": [total_revenue]
                                   })

# Format average price and total revenue as currency
purchasing_analysis["Average Price"] = purchasing_analysis["Average Price"].map("${:.2f}".format)
purchasing_analysis["Total Revenue"] = purchasing_analysis["Total Revenue"].map("${:.2f}".format)
purchasing_analysis

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [8]:
# Create dataframe without duplicate players

gender_df = purchase_data.loc[:,["SN","Gender"]]
gender_reduced = gender_df.drop_duplicates(subset=["SN"])
gender_reduced

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
773         Hala31    Male
774     Jiskjask80    Male
775     Aethedru70  Female
777     Yathecal72    Male
778        Sisur91    Male

[576 rows x 2 columns]

In [9]:
# Count of each gender series

gender_only_count = gender_reduced["Gender"].value_counts()
gender_only_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [10]:
# Series with percentage of players by gender

gender_percentage = gender_only_count/total_players*100
gender_percentage

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

In [11]:
# Dataframe with total count and percentage of players by gender

gender_analysis_df = pd.DataFrame({"Total Count": gender_only_count,
                                  "Percentage of Players": gender_percentage})

# Format percentage of players
gender_analysis_df["Percentage of Players"] = gender_analysis_df["Percentage of Players"].map("{:.2f}%".format)
gender_analysis_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [12]:
# # Create list to only show Gender and Price columns
gender_prices_list = ['Gender', 'Price']

# only_gender = purchase_data[gender_prices_list]
# only_gender.head()

In [13]:
# players = purchase_data["SN"].count()
# players_count = gender_df.drop_duplicates(subset=["SN"]).count()
# players_count = total_players_df["Total Players"]

# gender_df = purchase_data.loc[:,["SN","Gender"]]
# players_count = gender_df.drop_duplicates(subset=["SN"])

In [14]:
# Purchase count

gender_purchase_count = purchase_data[gender_prices_list].groupby(['Gender']).count()
gender_purchase_count = gender_purchase_count.rename(columns={"Price": "Purchase Count"})
gender_purchase_count

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

In [15]:
# Average Purchase Price

avg_gender_price = purchase_data[gender_prices_list].groupby(['Gender']).mean()
avg_gender_price = avg_gender_price.rename(columns={"Price": "Average Purchase Price"})


avg_gender_price["Average Purchase Price"] = avg_gender_price["Average Purchase Price"].map("${:.2f}".format)
avg_gender_price

                      Average Purchase Price
Gender
Female                                 $3.20
Male                                   $3.02
Other / Non-Disclosed                  $3.35

In [16]:
# Total Purchase Value
total_gender_value = purchase_data[gender_prices_list].groupby(['Gender']).sum()
total_gender_value = total_gender_value.rename(columns={"Price": "Total Purchase Value"})

total_gender_value

                       Total Purchase Value
Gender
Female                               361.94
Male                                1967.64
Other / Non-Disclosed                 50.19

In [17]:
# Average Total Purchase per Person

# Female average total purchase
female_total_purchase = total_gender_value.iloc[0, 0]
female_average = female_total_purchase / gender_analysis_df.iloc[1,0]

# Male average total purchase
male_total_purchase = total_gender_value.iloc[1, 0]
male_average = male_total_purchase / gender_analysis_df.iloc[0,0]
male_average

# Other / Non-Disclosed average total purchase
other_total_purchase = total_gender_value.iloc[2, 0]
other_average = other_total_purchase / gender_analysis_df.iloc[2,0]

# Dataframe average total purchase

average_purchase_person = pd.DataFrame({"Gender": ["Female", "Male", "Other / Non-Disclosed"],
                                        "Avg Total Purchase per Person":[female_average, male_average, other_average]})

average_purchase_person["Avg Total Purchase per Person"] = average_purchase_person["Avg Total Purchase per Person"].map("${:.2f}".format)
average_purchase_person

                  Gender Avg Total Purchase per Person
0                 Female                         $4.47
1                   Male                         $4.07
2  Other / Non-Disclosed                         $4.56

In [18]:
# Merged purchasing analysis by gender into one dataframe

merged1 = pd.merge(gender_purchase_count, avg_gender_price, on="Gender", how="left")
merged2 = pd.merge(merged1, total_gender_value, on="Gender", how="left")
gender_analytics_df = pd.merge(merged2, average_purchase_person, on="Gender", how="left")

# Format Total Purchase Value
gender_analytics_df["Total Purchase Value"] = gender_analytics_df["Total Purchase Value"].map("${:.2f}".format)
gender_analytics_df.set_index("Gender")

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [19]:
# Create age groups and bins for data

group_ages = [
    "<10",
    "10-14",
    "15-19",
    "20-24",
    "25-29",
    "30-34",
    "35-39",
    "40+"]

bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 100]

In [20]:
# Dataframe for age with no duplicate players

age_df = purchase_data.loc[:,["SN","Age"]]
age_df = age_df.drop_duplicates(subset=["SN"])

age_df

                SN  Age
0          Lisim78   20
1      Lisovynya38   40
2       Ithergue48   24
3    Chamassasya86   24
4        Iskosia90   23
..             ...  ...
773         Hala31   21
774     Jiskjask80   11
775     Aethedru70   21
777     Yathecal72   20
778        Sisur91    7

[576 rows x 2 columns]

In [21]:
# Add Age Group column to dataframe

age_df["Age Group"] = pd.cut(age_df.Age, bins, labels = group_ages, include_lowest=True)
age_df

                SN  Age Age Group
0          Lisim78   20     20-24
1      Lisovynya38   40       40+
2       Ithergue48   24     20-24
3    Chamassasya86   24     20-24
4        Iskosia90   23     20-24
..             ...  ...       ...
773         Hala31   21     20-24
774     Jiskjask80   11     10-14
775     Aethedru70   21     20-24
777     Yathecal72   20     20-24
778        Sisur91    7       <10

[576 rows x 3 columns]

In [22]:
# Divide value counts of age groups by the number of total players to get percentage

age_group_counts = age_df["Age Group"].value_counts()
age_percentage = age_group_counts / total_players * 100
age_percentage

20-24    44.791667
15-19    18.576389
25-29    13.368056
30-34     9.027778
35-39     5.381944
10-14     3.819444
<10       2.951389
40+       2.083333
Name: Age Group, dtype: float64

In [23]:
# Create dataframe using dictionary then format percentage of players.

age_demographics = pd.DataFrame({"Total Count": age_group_counts,
                                "Percentage of Players": age_percentage})

age_demographics["Percentage of Players"] = age_demographics["Percentage of Players"].map("{:.2f}%".format)

# Sort age group by ascending order
age_demographics.sort_index(axis=0)

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [24]:
# Create age groups and bins for purchase_data

group_ages = [
    "<10",
    "10-14",
    "15-19",
    "20-24",
    "25-29",
    "30-34",
    "35-39",
    "40+"]

bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 100]

In [25]:
age_purchase = purchase_data.loc[:,["Age", "Price"]]

age_purchase

     Age  Price
0     20   3.53
1     40   1.56
2     24   4.88
3     24   3.27
4     23   1.44
..   ...    ...
775   21   3.54
776   21   1.63
777   20   3.46
778    7   4.19
779   24   4.60

[780 rows x 2 columns]

In [26]:
age_purchase["Age Group"] = pd.cut(age_purchase.Age, bins, labels = group_ages, include_lowest=True)
age_purchase

     Age  Price Age Group
0     20   3.53     20-24
1     40   1.56       40+
2     24   4.88     20-24
3     24   3.27     20-24
4     23   1.44     20-24
..   ...    ...       ...
775   21   3.54     20-24
776   21   1.63     20-24
777   20   3.46     20-24
778    7   4.19       <10
779   24   4.60     20-24

[780 rows x 3 columns]

In [27]:
age_purchase_count = age_purchase["Age Group"].value_counts()
age_purchase_count = age_purchase_count.sort_index(axis=0)
age_purchase_count

<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age Group, dtype: int64

In [28]:
# Average purchase price by age group
avg_age_price = age_purchase.groupby(['Age Group']).mean()
avg_age_price = avg_age_price["Price"]
avg_age_price

Age Group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [29]:
# Total purchase value by age group
age_total_purchase = age_purchase.groupby(['Age Group']).sum()
age_total_purchase = age_total_purchase["Price"]
age_total_purchase

Age Group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [30]:
# Create dataframe with purchase count, average purchase price, and total purchase value
age_purchase_analysis_df = pd.DataFrame({"Group Ages": group_ages,
                                         "Purchase Count": age_purchase_count,
                                        "Average Purchase Price": avg_age_price,
                                        "Total Purchase Value": age_total_purchase})

# Format
age_purchase_analysis_df["Average Purchase Price"] = age_purchase_analysis_df["Average Purchase Price"].map("${:.2f}".format)
age_purchase_analysis_df["Total Purchase Value"] = age_purchase_analysis_df["Total Purchase Value"].map("${:.2f}".format)

# Set group ages as index
age_purchase_analysis_df = age_purchase_analysis_df.set_index('Group Ages')
age_purchase_analysis_df

            Purchase Count Average Purchase Price Total Purchase Value
Group Ages
<10                     23                  $3.35               $77.13
10-14                   28                  $2.96               $82.78
15-19                  136                  $3.04              $412.89
20-24                  365                  $3.05             $1114.06
25-29                  101                  $2.90              $293.00
30-34                   73                  $2.93              $214.00
35-39                   41                  $3.60              $147.67
40+                     13                  $2.94               $38.24

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [31]:
# Create dataframe with purchase count. Group by SN then sum purchase count and price
top_spenders = purchase_data.loc[:,["SN","Price"]]
top_spenders['Purchase Count'] = 1
top_spenders_df = top_spenders.groupby(['SN']).sum()
top_spenders_df

               Price  Purchase Count
SN
Adairialis76    2.28               1
Adastirin33     4.48               1
Aeda94          4.91               1
Aela59          4.32               1
Aelaria33       1.79               1
...              ...             ...
Yathecal82      6.22               3
Yathedeu43      6.02               2
Yoishirrala98   4.58               1
Zhisrisu83      7.89               2
Zontibe81       8.03               3

[576 rows x 2 columns]

In [32]:
# Sort top spenders by descending price
top_spenders_df = top_spenders_df.sort_values(by='Price', ascending=False)
top_spenders_df = top_spenders_df.head(5)
top_spenders_df

             Price  Purchase Count
SN
Lisosia93    18.96               5
Idastidru52  15.45               4
Chamjask73   13.83               3
Iral74       13.62               4
Iskadarya95  13.10               3

In [33]:
# Average purchase price of each top spender
sn_average_purchase_price = top_spenders_df["Price"] / top_spenders_df["Purchase Count"]
sn_average_purchase_price

SN
Lisosia93      3.792000
Idastidru52    3.862500
Chamjask73     4.610000
Iral74         3.405000
Iskadarya95    4.366667
dtype: float64

In [34]:
# Rename and rearrange columns
top_spenders_df2 = pd.concat([top_spenders_df, sn_average_purchase_price], axis=1)
top_spenders_df2 = top_spenders_df2.rename(columns = {0: 'Average Purchase Price',
                                                     "Price": "Total Purchase Value"})
top_spenders_df2 = top_spenders_df2.reindex(columns = ['Purchase Count', 'Average Purchase Price', 'Total Purchase Value'])

# Format prices
top_spenders_df2["Average Purchase Price"] = top_spenders_df2["Average Purchase Price"].map("${:.2f}".format)
top_spenders_df2["Total Purchase Value"] = top_spenders_df2["Total Purchase Value"].map("${:.2f}".format)

top_spenders_df2

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [61]:
items = purchase_data.loc[:,["Item ID", "Item Name", "Price"]]
items['Purchase Count'] = 1

# Sum purchase count and price
items = items.groupby(['Item ID','Item Name']).sum()
items

                                                      Price  Purchase Count
Item ID Item Name
0       Splinter                                       5.12               4
1       Crucifer                                      11.77               4
2       Verdict                                       14.88               6
3       Phantomlight                                  14.94               6
4       Bloodlord's Fetish                             8.50               5
...                                                     ...             ...
178     Oathbreaker, Last Hope of the Breaking Storm  50.76              12
179     Wolf, Promise of the Moonwalker               26.88               6
181     Reaper's Toll                                  8.30               5
182     Toothpick                                     12.09               3
183     Dragon's Greatsword                            3.27               3

[179 rows x 2 columns]

In [62]:
# Sort popular items by descending price
items = items.sort_values(by='Price', ascending=False)
items = items.head(5)
items

                                                      Price  Purchase Count
Item ID Item Name
92      Final Critic                                  59.99              13
178     Oathbreaker, Last Hope of the Breaking Storm  50.76              12
82      Nirvana                                       44.10               9
145     Fiery Glass Crusader                          41.22               9
103     Singed Scalpel                                34.80               8

In [63]:
# Price of each top item
items_price = items["Price"] / items["Purchase Count"]
items_price

Item ID  Item Name
92       Final Critic                                    4.614615
178      Oathbreaker, Last Hope of the Breaking Storm    4.230000
82       Nirvana                                         4.900000
145      Fiery Glass Crusader                            4.580000
103      Singed Scalpel                                  4.350000
dtype: float64

In [65]:
# Rename and rearrange columns
items2 = pd.concat([items, items_price], axis=1)

items2 = items2.rename(columns = {0: 'Item Price',
                                "Price": "Total Purchase Value"})
items2 = items2.reindex(columns = ['Purchase Count', 'Item Price', 'Total Purchase Value'])
items2

# Format prices
items2["Item Price"] = items2["Item Price"].map("${:.2f}".format)
items2["Total Purchase Value"] = items2["Total Purchase Value"].map("${:.2f}".format)

items2

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [ ]:
# Sort by item price descending order.